# Вывести на экран "Курс Основы программирования начался"

print ("Курс основы программирования начался!")
