# Вывести на экран остаток от деления 16823 * 12302 / 3092.

print((16823*12302)%3092)