# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.

print('Введите число а:')
a = int(input())

print('Введите число b:')
b = int(input())

print('Введите число c:')
c = int(input())

print('Сумма этих чисел:')
print(a+b+c)